classes/rogue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-11 Mon 19:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rogue</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rogue</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6df0485">1. Proficiencies</a></li>
<li><a href="#org8bb24f0">2. Level-up</a></li>
</ul>
</div>
</div>
<p>
Sneak, steal, deceive, and assassinate those who oppose your endeavors.
</p>

<p>
To begin as a rogue, chose a subclass [<a href="subclasses/ninja.html#ID-befa4d8e-52ce-4195-9f97-06aee49da164">Ninja</a>, <a href="subclasses/con_man.html#ID-072dbba0-dd37-4c57-ae44-959867358be8">Con man</a>]. These classes give you special traits that increase in power as you get stronger, and a few distinct advantages right off the bat.
</p>

<ul class="org-ul">
<li><span class="underline">Initial Health</span>: Roll 1d6 and add it to your base HP. This is your Hit Die (HD). You will add the amount you roll to your base health every time you level up.</li>
<li>Gain 1 toolkit</li>
</ul>

<div id="outline-container-org6df0485" class="outline-2">
<h2 id="org6df0485"><span class="section-number-2">1.</span> Proficiencies</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Armor</th>
<th scope="col" class="org-left">Weapons</th>
<th scope="col" class="org-left">Tools</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Light Armor</td>
<td class="org-left">Daggers</td>
<td class="org-left">Thieves Tools</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Bows</td>
<td class="org-left">Lockpicking Kit</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Crossbows</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spears</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Shortswords</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8bb24f0" class="outline-2">
<h2 id="org8bb24f0"><span class="section-number-2">2.</span> Level-up</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Gain Sneak Attack. If invisible or hidden, gain an extra 1d6 damage on the next attack.</li>
<li>Add 1d6 health.</li>
<li>Become proficient with a new class of weapon. Your next purchase of this class of weapon is discounted by 50%. Add 1d6 health.</li>
<li>You are now able to hide in plain sight upon passing a deception check that surpasses a perception check made by your enemy. Your Deception modifier is + 3.</li>
<li>Your Deception, Stealth, and Sleight of Hand modifiers all increase by 1. Your Dexterity modifier increases by 1.</li>
<li>Sneak Attack’s damage increases to 2d6. Add 1d6 health.</li>
<li>Subclass Feature. Add 1d6 health.</li>
<li>Become proficient with a new class of weapon. Your next purchase of this class of weapon is discounted 50%. Add 1d6 health.</li>
<li>Your Deception, Stealth, and Sleight of Hand modifiers all increase by 1. Your Dexterity score increases by 1.</li>
<li>Gain Betrayal. If the creature you are attacking believes you to be their ally, you deal double damage.</li>
<li>Sneak Attack now applies to enemies who did not target you on their last turn. Add 1d6 health.</li>
<li>Sneak Attack’s damage increases to 3d6. Add 1d6 health.</li>
<li>Subclass into an additional class.</li>
<li>Your modifier for Hide in Plain Sight is now Deception + 5. Add 1d6 health.</li>
<li>Gain Assassinate. If you are not sensed by your enemy before attacking, you deal triple damage on your first attack and no longer have to roll to hit.</li>
<li>Your Deception, Stealth, and Sleight of Hand modifiers all increase by 1. Your Dexterity score all increases by 1. Add 1d6 health.</li>
<li>Your modifier for Hide in Plain Sight is now Deception - 2. Add 1d6 health.</li>
<li>Sneak Attack’s damage increases to 4d6.</li>
<li>Subclass Feature. Add 1d6 health.</li>
<li>Multiclass</li>
</ol>
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-05 Wed 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-09-11 Mon 19:48</p>
</div>
</body>
</html>